# Create a DataFrame

In [1]:
import pandas as pd
import numpy as np

### Creating DataFrame with disctionary
  * You can also create DataFrame with python disctionary very easily.
  * You just need to call DataFrame() function and pass the disctionary as a argument in the function.
  * <b>Note:</b> Notice one thing that i have taken all the columns of same length because you can not make dataframe object if your disctionary has variable column length

In [2]:
#Creatiing my own disctionary
mydict={
         'dates':['02-01-12','03-01-12','04-01-12','05-01-12','06-01-12'],
         'day':['sunny','rainy','hot','sunny','hot'],
         'wind-speed':[12,34,45,56,67],
         'temp':[45,46,47,48,49]
       }
#Converting disction to dataframe object
df=pd.DataFrame(mydict)

#Printing the dataframe
df

      dates    day  wind-speed  temp
0  02-01-12  sunny          12    45
1  03-01-12  rainy          34    46
2  04-01-12    hot          45    47
3  05-01-12  sunny          56    48
4  06-01-12    hot          67    49

### Renames columns

In [3]:
df.columns = ['a','b','c','d']
df

          a      b   c   d
0  02-01-12  sunny  12  45
1  03-01-12  rainy  34  46
2  04-01-12    hot  45  47
3  05-01-12  sunny  56  48
4  06-01-12    hot  67  49

In [4]:
df.rename(columns = {'a':'A', 'b':'B'})

          A      B   c   d
0  02-01-12  sunny  12  45
1  03-01-12  rainy  34  46
2  04-01-12    hot  45  47
3  05-01-12  sunny  56  48
4  06-01-12    hot  67  49

### Create an example DataFrame of normally distributed random numbers:

In [5]:
# Use a random seed to make reproducible data.
np.random.seed(1)
df = pd.DataFrame(np.random.randn(5,4), columns=['c1','c2','c3','c4'])
df

         c1        c2        c3        c4
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815

# Add new columns to a DataFrame

### Add a new column with 1 value:

In [6]:
df["c5"] = np.nan
df

         c1        c2        c3        c4  c5
0  1.624345 -0.611756 -0.528172 -1.072969 NaN
1  0.865408 -2.301539  1.744812 -0.761207 NaN
2  0.319039 -0.249370  1.462108 -2.060141 NaN
3 -0.322417 -0.384054  1.133769 -1.099891 NaN
4 -0.172428 -0.877858  0.042214  0.582815 NaN

### Checks for null Values, Returns Boolean Array

In [7]:
df.isnull()

      c1     c2     c3     c4    c5
0  False  False  False  False  True
1  False  False  False  False  True
2  False  False  False  False  True
3  False  False  False  False  True
4  False  False  False  False  True

### Opposite of s.isnull()

In [8]:
df.notnull()

     c1    c2    c3    c4     c5
0  True  True  True  True  False
1  True  True  True  True  False
2  True  True  True  True  False
3  True  True  True  True  False
4  True  True  True  True  False

### Droping the rows containing NaN

In [9]:
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

### did not change the original df values

In [10]:
df

         c1        c2        c3        c4  c5
0  1.624345 -0.611756 -0.528172 -1.072969 NaN
1  0.865408 -2.301539  1.744812 -0.761207 NaN
2  0.319039 -0.249370  1.462108 -2.060141 NaN
3 -0.322417 -0.384054  1.133769 -1.099891 NaN
4 -0.172428 -0.877858  0.042214  0.582815 NaN

### Drops all columns that contain null values

In [11]:
df.dropna(axis=1)

         c1        c2        c3        c4
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815

### Add a series as a new column:

In [12]:
# Add a categorical series the same length as the DataFrame:
categorical_series = np.random.choice(["cat", "dog"], size=(5,1))
df["cat_column"] = categorical_series
df

         c1        c2        c3        c4  c5 cat_column
0  1.624345 -0.611756 -0.528172 -1.072969 NaN        cat
1  0.865408 -2.301539  1.744812 -0.761207 NaN        cat
2  0.319039 -0.249370  1.462108 -2.060141 NaN        dog
3 -0.322417 -0.384054  1.133769 -1.099891 NaN        dog
4 -0.172428 -0.877858  0.042214  0.582815 NaN        cat

# Replacing NaN with specific value

In [13]:
df.fillna(999,inplace=True)
df

         c1        c2        c3        c4     c5 cat_column
0  1.624345 -0.611756 -0.528172 -1.072969  999.0        cat
1  0.865408 -2.301539  1.744812 -0.761207  999.0        cat
2  0.319039 -0.249370  1.462108 -2.060141  999.0        dog
3 -0.322417 -0.384054  1.133769 -1.099891  999.0        dog
4 -0.172428 -0.877858  0.042214  0.582815  999.0        cat

# Sort a DataFrame

### Sort the DataFrame by a specified column:

In [14]:
df.sort_values(by="c2")

         c1        c2        c3        c4     c5 cat_column
1  0.865408 -2.301539  1.744812 -0.761207  999.0        cat
4 -0.172428 -0.877858  0.042214  0.582815  999.0        cat
0  1.624345 -0.611756 -0.528172 -1.072969  999.0        cat
3 -0.322417 -0.384054  1.133769 -1.099891  999.0        dog
2  0.319039 -0.249370  1.462108 -2.060141  999.0        dog

### Note this returns a new DataFrame and doesn't alter the original:

In [15]:
df

         c1        c2        c3        c4     c5 cat_column
0  1.624345 -0.611756 -0.528172 -1.072969  999.0        cat
1  0.865408 -2.301539  1.744812 -0.761207  999.0        cat
2  0.319039 -0.249370  1.462108 -2.060141  999.0        dog
3 -0.322417 -0.384054  1.133769 -1.099891  999.0        dog
4 -0.172428 -0.877858  0.042214  0.582815  999.0        cat

### Use <code>inplace=True</code> to alter the original DataFrame:

In [16]:
df.sort_values(by="c2", inplace=True)
df

         c1        c2        c3        c4     c5 cat_column
1  0.865408 -2.301539  1.744812 -0.761207  999.0        cat
4 -0.172428 -0.877858  0.042214  0.582815  999.0        cat
0  1.624345 -0.611756 -0.528172 -1.072969  999.0        cat
3 -0.322417 -0.384054  1.133769 -1.099891  999.0        dog
2  0.319039 -0.249370  1.462108 -2.060141  999.0        dog

### sort in descending order

In [17]:
df.sort_values(by="c2", inplace=True, ascending = False)
df

         c1        c2        c3        c4     c5 cat_column
2  0.319039 -0.249370  1.462108 -2.060141  999.0        dog
3 -0.322417 -0.384054  1.133769 -1.099891  999.0        dog
0  1.624345 -0.611756 -0.528172 -1.072969  999.0        cat
4 -0.172428 -0.877858  0.042214  0.582815  999.0        cat
1  0.865408 -2.301539  1.744812 -0.761207  999.0        cat

# Filter a DataFrame

### Filter to a subset of the data using 1 criteria:

In [18]:
df[df["c1"]<0.5]

         c1        c2        c3        c4     c5 cat_column
2  0.319039 -0.249370  1.462108 -2.060141  999.0        dog
3 -0.322417 -0.384054  1.133769 -1.099891  999.0        dog
4 -0.172428 -0.877858  0.042214  0.582815  999.0        cat

### Filter to a subset of the data using multiple criteria:

In [19]:
df[(df["c1"]<0.5) & (df["c3"]>1) ]

         c1        c2        c3        c4     c5 cat_column
2  0.319039 -0.249370  1.462108 -2.060141  999.0        dog
3 -0.322417 -0.384054  1.133769 -1.099891  999.0        dog

# Transpose a DataFrame

### Transpose the DataFrame:

In [20]:
df.T

                   2         3         0          4         1
c1          0.319039 -0.322417   1.62435  -0.172428  0.865408
c2          -0.24937 -0.384054 -0.611756  -0.877858  -2.30154
c3           1.46211   1.13377 -0.528172  0.0422137   1.74481
c4          -2.06014  -1.09989  -1.07297   0.582815 -0.761207
c5               999       999       999        999       999
cat_column       dog       dog       cat        cat       cat

# Basic inspection of a DataFrame

### Create an example DataFrame of normally distributed random numbers:

In [21]:
# Use a random seed to make reproducible data.
np.random.seed(1)
df = pd.DataFrame(np.random.randn(1500,4), columns=['c1','c2','c3','c4'])

### Look at the first <i>x</i> rows of the DataFrame:

In [22]:
# x = 4
df.head(4)

         c1        c2        c3        c4
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891

### or the last:

In [23]:
# x = 4
df.tail(4)

            c1        c2        c3        c4
1496  0.064929  0.072010  0.769702 -0.801340
1497 -2.698919  0.286289 -0.680370 -0.687549
1498 -0.210634 -0.343140  0.957570  0.224605
1499 -0.477144 -0.691212 -0.788731  0.264185

### Find out the length of the DataFrame:

In [24]:
len(df)

1500

### Find out the shape of the DF

In [25]:
df.shape

(1500, 4)

### Get a list of the column names:
Useful if the DataFrame has too many columns to display them all in a Jupyter notebook using <code>df.head()</code>

In [26]:
list(df.columns)

['c1', 'c2', 'c3', 'c4']

### See the summary statistics of the DataFrame:

In [27]:
df.describe()

                c1           c2           c3           c4
count  1500.000000  1500.000000  1500.000000  1500.000000
mean      0.029470    -0.047509     0.013409     0.052001
std       1.031155     0.988760     0.981728     1.000610
min      -3.260615    -3.016032    -2.984836    -3.190616
25%      -0.641095    -0.718213    -0.659455    -0.615079
50%       0.022440    -0.073805     0.036628     0.061825
75%       0.681085     0.609799     0.653204     0.723486
max       3.321079     3.958603     3.135047     3.740249

### getting statistics

In [28]:
df.mean()

c1    0.029470
c2   -0.047509
c3    0.013409
c4    0.052001
dtype: float64

In [29]:
df.corr()

          c1        c2        c3        c4
c1  1.000000 -0.056280  0.016201  0.006716
c2 -0.056280  1.000000  0.020439 -0.031367
c3  0.016201  0.020439  1.000000  0.013454
c4  0.006716 -0.031367  0.013454  1.000000

In [30]:
df.std()

c1    1.031155
c2    0.988760
c3    0.981728
c4    1.000610
dtype: float64

In [31]:
df.max()

c1    3.321079
c2    3.958603
c3    3.135047
c4    3.740249
dtype: float64

In [32]:
df.min()

c1   -3.260615
c2   -3.016032
c3   -2.984836
c4   -3.190616
dtype: float64

In [33]:
df.median()

c1    0.022440
c2   -0.073805
c3    0.036628
c4    0.061825
dtype: float64

# Slicing a DataFrame

### Accessing rows :

In [34]:
df[0:2]

         c1        c2        c3        c4
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207

### Accessing columns :

In [35]:
df[['c3','c4']]

            c3        c4
0    -0.528172 -1.072969
1     1.744812 -0.761207
2     1.462108 -2.060141
3     1.133769 -1.099891
4     0.042214  0.582815
...        ...       ...
1495 -0.332064 -0.216062
1496  0.769702 -0.801340
1497 -0.680370 -0.687549
1498  0.957570  0.224605
1499 -0.788731  0.264185

[1500 rows x 2 columns]

# Slice a DataFrame with <code>.loc</code>

### Slice the DataFrame with <code>.loc</code>
<code>.loc</code> lets you slice the data by specifying the subset of rows, followed by the subset of columns.

### Select first 10 rows of columns c1 and c2

In [36]:
df = df.loc[:10, ["c1","c2"]]
df

          c1        c2
0   1.624345 -0.611756
1   0.865408 -2.301539
2   0.319039 -0.249370
3  -0.322417 -0.384054
4  -0.172428 -0.877858
5  -1.100619  1.144724
6   0.900856 -0.683728
7  -0.267888  0.530355
8  -0.687173 -0.845206
9  -1.117310  0.234416
10 -0.191836 -0.887629

### Select all rows and columns

In [37]:
df.loc[:,:]

          c1        c2
0   1.624345 -0.611756
1   0.865408 -2.301539
2   0.319039 -0.249370
3  -0.322417 -0.384054
4  -0.172428 -0.877858
5  -1.100619  1.144724
6   0.900856 -0.683728
7  -0.267888  0.530355
8  -0.687173 -0.845206
9  -1.117310  0.234416
10 -0.191836 -0.887629

### Select all rows of column c1

In [38]:
df.loc[:, "c1"]

0     1.624345
1     0.865408
2     0.319039
3    -0.322417
4    -0.172428
5    -1.100619
6     0.900856
7    -0.267888
8    -0.687173
9    -1.117310
10   -0.191836
Name: c1, dtype: float64

### Select column c2 where column c1 is less than 0

In [39]:
df.loc[df["c1"]<0, "c2"]

3    -0.384054
4    -0.877858
5     1.144724
7     0.530355
8    -0.845206
9     0.234416
10   -0.887629
Name: c2, dtype: float64

### Compare with slicing without <code>.loc</code>

In [40]:
df[df["c1"]<0, 'c2']

TypeError: '(0     False
1     False
2     False
3      True
4      True
5      True
6     False
7      True
8      True
9      True
10     True
Name: c1, dtype: bool, 'c2')' is an invalid key

# Slice a DataFrame with <code>.iloc</code>

In [ ]:
df.iloc[0:4]

In [ ]:
df.iloc[0:3,0:3]

# Removing duplicates

In [ ]:
df = pd.DataFrame({'k1':['one']*3 + ['two']*4, 'k2':[1,1,2,3,3,4,4]})
df

### see the duplicate entries

In [ ]:
df.duplicated()

### drop the duplicate entries

In [ ]:
df.drop_duplicates()

In [ ]:
?df.drop_duplicates

In [ ]:
df.drop_duplicates(keep='last')

In [ ]:
df.shape

In [ ]:
df['range'] = range(df.shape[0])
df

In [ ]:
df.drop_duplicates(subset = ['k1'], keep='last')

# Set a Datetime Column as the Index

### Load the example *timeseries_daily.csv* dataset:

In [ ]:
df = pd.read_csv("./timeseries_daily.csv")
df.head()

### Save the example *timeseries_daily.csv* dataset:

In [ ]:
df.to_csv('./timeseries_daily_tmp.csv',index=False)

### Create a proper datetime column:

In [ ]:
# Create a proper datetime column
df["datetime"] = pd.to_datetime(df["Date"], dayfirst=True)

df.head()

### Set the column as the DataFrame Index:

Note the <code>inplace=True<code> flag, which means that the original DataFrame is changed. If <code>inplace=False</code> (the default) is used instead, then a new DataFrame will be returned and the original remains unchanged.

In [ ]:
df.set_index(["datetime"], inplace=True)
df.head()

### Views unique values and counts

In [ ]:
df['weekday'].value_counts()

In [ ]:
df['feature_1'].value_counts().head(10)

### modify the datafame

In [ ]:
df['weekday'].map(str.lower).head(10)

In [ ]:
weekday_to_nickname = {'Monday':'a', 'Tuesday':'b', 'Wednesday':'c', 'Thursday':'d', 'Friday':'e',
                      'Saturday':'f', 'Sunday':'g'}
df['weekday'].map(weekday_to_nickname).head()

### Replaces values

In [ ]:
df.replace('Monday','M').head(20)

In [ ]:
df.replace(['Monday', 0], ['M', -999]).head(20)

# apply lambda function

In [ ]:
df.apply(lambda x: x[0]**2, axis = 1)

In [ ]:
df.apply(lambda x: 3 if x['weekday'] = 'Sunday' else 0, axis = 1)

# Aggregate Data with Groupby
### Syntax:

The <code>groupby</code> syntax a little difficult to remember at first, so here it is broken down:

><code>df.groupby([<span style="color:blue">"col", "optional_col", "etc"</span>])[<span style="color:red">"col", "optional_col", "etc"</span>].<span style="color:green">function()</span> </code>

The column(s) in <span style="color:blue">blue</span> are the features that you want to group *by*.

The column(s) in <span style="color:red">red</span> are the features you want to aggregate (i.e. the data you want to summarise with a function such as mean, sum, max, min, etc.)

The function in <span style="color:green">green</span> is how you want to aggregate the data, for example, "mean" or "sum".

### Example:

In [ ]:
g=df.groupby('weekday')
g

In [ ]:
for weekday,data in g:
    print(weekday)
    print("-"*10)
    print(data[0:5])
    print("-"*35)

In [ ]:
print(data.index)

### get_group('group name')

In [ ]:
g.get_group('Friday')[0:5]

### if do not specify the column(s) in <span style="color:red">red</span>

In [ ]:
df.groupby(["weekday"]).mean()

### Group 1 feature by another feature:

In [ ]:
df.groupby(["weekday"])["feature_3"].mean()

### Group multiple features by 1 feature:

In [ ]:
df.groupby(["weekday", "categorical_feature"])["feature_3"].mean()

### Group multiple features by multiple features:

In [ ]:
df.groupby(["weekday", "categorical_feature"])["feature_3", "feature_1"].mean()

#### Use <code>as_index=False</code> to return a 'flat' DataFrame:

In [ ]:
df.groupby(["weekday", "categorical_feature"], as_index=False)["feature_3", "feature_1"].mean()

In [ ]:
df.groupby(["weekday", "categorical_feature"], as_index=False)["feature_3", "feature_1"].count()

### return single column

In [ ]:
def singleCols(sub_df):
    out = {}
    feature_5 = 0
    featture_6 = "" 
    for idx, row in sub_df.iterrows():
        feature_5 += row['feature_1']*row['feature_2'] + row['feature_3']*row['feature_4']
        feature_6 = row['weekday'] + ";" + row['categorical_feature'] + "|"
    return str(feature_5) + feature_6

In [ ]:
df.groupby(["weekday", "categorical_feature"]).apply(singleCols).reset_index()

### return multiple columns

In [ ]:
def multiCols(sub_df):
    out = {}
    feature_5 = 0
    featture_6 = "" 
    for idx, row in sub_df.iterrows():
        feature_5 += row['feature_1']*row['feature_2'] + row['feature_3']*row['feature_4']
        feature_6 = row['weekday'] + ";" + row['categorical_feature'] + "|"
    out['feature_5'] = feature_5
    out['feature_6'] = feature_6
    return pd.Series(out, index = ['feature_5', 'feature_6'])
    # return pd.Series(json.dumps(out), index = ['feat_dict'])

In [ ]:
df.groupby(["weekday", "categorical_feature"]).apply(multiCols)

In [ ]:
df1 = df.groupby(["weekday", "categorical_feature"], as_index=False).apply(multiCols)
df1

### use json for simplicity

In [ ]:
import json
def multiCols(sub_df):
    out = {}
    feature_5 = 0
    featture_6 = "" 
    for idx, row in sub_df.iterrows():
        feature_5 += row['feature_1']*row['feature_2'] + row['feature_3']*row['feature_4']
        feature_6 = row['weekday'] + ";" + row['categorical_feature'] + "|"
    out['feature_5'] = feature_5
    out['feature_6'] = feature_6
    # return pd.Series(out, index = ['feature_5', 'feature_6'])
    return pd.Series(json.dumps(out), index = ['feat_dict'])

In [ ]:
df.groupby(["weekday", "categorical_feature"]).apply(multiCols)

In [ ]:
df1 = df.groupby(["weekday", "categorical_feature"], as_index=False).apply(multiCols)
df1

In [ ]:
type(df1)

In [ ]:
# df1.index = df.index.set_names(['weekday', 'categorical_feature'])
df1.reset_index(inplace=True)

In [ ]:
df1.reset_index()
df1.columns

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame(df1)
list(df2)

#### Change format of output:
The format of the object returned can also be changed, for example using <code>.to_json()</code>, <code>.to_dict()</code>, <code>.to_csv()</code>, etc.

In [ ]:
df.groupby(["weekday"])["feature_3"].mean().to_dict()

# Dummy Variables AKA One-Hot Encoding

In machine learning algorithms for regression or classification it is often necessary to encode categorical data so that it can be evaluated by the learning algorithm. This can be done by encoding each categorical value as a unique boolean feature (i.e. 1 for True, 0 for False). For example, if there was a feature of "Gender" with values of "Male", "Female", or "Other"; this can be encoded into 3 separate boolean columns; as below:


| Gender | Male   | Female | Other |
|------|------|------|------|
|   Male  | 1 | 0 | 0 |
|   Female  | 0 |1 | 0 |
|   Other  | 0 | 0 | 1 |


#### Example:

In [ ]:
df.head()

#### Use pandas <code>get_dummies()</code> to create the boolean columns:
Running the function returns a DataFrame with the same length as the categorical feature, and number of columns equal to the number of unique values in the categorical feature.

In [ ]:
dummies = pd.get_dummies(df["categorical_feature"])
dummies.tail()

In [ ]:
dummies.shape

#### This can be joined to the original DataFrame:

In [ ]:
new_df = pd.concat([df, dummies], axis=1)
new_df.tail()

#### For clarity, you can add prefixes to the dummy columns:

In [ ]:
dummies_prefixed = pd.get_dummies(df["categorical_feature"], prefix="category", prefix_sep=": ")
dummies_prefixed.tail()

#### Don't fall for the "<a href="http://www.algosome.com/articles/dummy-variable-trap-regression.html" target="_blank">Dummy Variable Trap</a>":
For machine learning purposes it is often necessary to drop one category from the dummy features created, and leave this as the "default" option; otherwise we run into problems with regression models where some of the categories may be correlated. Pandas <code>get_dummies</code> includes the option to exclude the first category:

In [ ]:
dummies_drop_first = pd.get_dummies(df["categorical_feature"], drop_first=True)
dummies_drop_first.tail()

# Sorting a DataFrame by Custom Values

How to sort a Pandas DataFrame by custom values.

### Example

Suppose you have a weekday column in string format that you want to sort by day of the week, not alphabetically.

In [ ]:
df.head()

### Convert the column to `Categorical`, providing the values you want to sort by in the order they should be sorted

In [ ]:
weekday_order = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]
df["weekday"] = pd.Categorical(df["weekday"], weekday_order)

In [ ]:
pd.Categorical(df["weekday"], weekday_order)

### Now when sorting by this column it will sort by the custom order you supplied

In [ ]:
df.sort_values(by="weekday").head()

In [ ]:
df.sort_values(by="weekday").tail()

## Merging dataframes 
-------
    merge() is a method in pandas in which you can merge two dataframes withou repeating columns as we did in
    concat() method.
    There are two types of merging -
       1) Inner join
       2) outer join

 ### 1) Inner join
    In this method you will get the intersetion of two dataframes with merged column.It is the default merge method.
    In merge() method you have to pass the dataframes as arguments and list of columns on which you want to merge
    and dataframes as arguments.

In [ ]:
temp1={
      "date":['01-02-12','03-02-12','04-02-12','05-02-12'],
      "event":['sunny','cold','cold','rainy'],
      "temp":[14,16,15,10]
}
temp=pd.DataFrame(temp1)
temp

In [ ]:
ws={
      "date":['01-02-12','03-02-12','04-02-12','05-02-12'],
      "event":['sunny','cold','cold','rainy'],
      "wind-speed":[12,10,9,14],
}
wind_speed=pd.DataFrame(ws)
wind_speed

In [ ]:
df=pd.merge(temp,wind_speed,on=['date','event'])
df

### If you have different data in the common columns then you can not do inner merge in this case.


    Assume the following case:
    
      temp                                
      ___________________
     | event  |   temp   |
     |--------|----------|
     | sunny  |   40     |
     | hot    |   30     |
     | rainy  |   25     |
     |________|__________|
     
     wind-speed
      ___________________
     | event  |wind-speed|
     |--------|----------|
     | sunny  |   12     |
     | hot    |   14     |
     | hot    |   11     |
     |________|__________|
     
     Merged Dataframe by inner method
     
      ________________________________
     | event  |   temp   | wind-speed |
     |--------|----------|------------|
     | sunny  |   40     |     12     | 
     | hot    |   30     |     14     |
     |________|__________|____________|
     
     You can see that last row is not merged here because there is no common element in the common columns.

In [ ]:
temp1={
      "event":['sunny','hot','rainy'],
      "temp":[40, 30, 25]
}
temp=pd.DataFrame(temp1)

ws={
      "event":['sunny','hot','hot'],
      "wind-speed":[12,14,11],
}
wind_speed=pd.DataFrame(ws)

In [ ]:
df=pd.merge(temp,wind_speed,on=['event'])
df

### Outer join
This is just like union of two dataframe.The value which dont exist will contain NaN.                               
     

     temp                                
      ___________________
     | event  |   temp   |
     |--------|----------|
     | sunny  |   40     |
     | hot    |   30     |
     | rainy  |   25     |
     |________|__________|
     
     wind-speed
      ___________________
     | event  |wind-speed|
     |--------|----------|
     | sunny  |   12     |
     | hot    |   14     |
     | hot    |   11     |
     |________|__________|
     
     Merged Dataframe by inner method
     
      ________________________________
     | event  |   temp   | wind-speed |
     |--------|----------|------------|
     | sunny  |   40     |     12     | 
     | hot    |   30     |     14     |
     | rainy  |   25     |     NaN    |
     | hot    |   NaN    |     11     |
     |________|__________|____________|
     
     You can see in the final dataframe two rows increased.

In [ ]:
temp1={
      "date":['01-02-12','03-02-12','04-02-12','05-02-12'],
      "event":['sunny','cold','hot','sunny'],
      "temp":[14,16,15,10]
}
temp=pd.DataFrame(temp1)
ws={
      "date":['01-02-12','03-02-12','04-02-12','05-02-12'],
      "event":['sunny','cold','cold','rainy'],
      "wind-speed":[12,10,9,14],
}
wind_speed=pd.DataFrame(ws)

### One extra argument you need to pass in outer join i.e, how="outer".By defaut it is inner.

In [ ]:
df=pd.merge(temp,wind_speed,on=['date','event'],how='outer')
df

In [ ]:
df.index

# Iterate over rows in a DataFrame in Pandas

In [ ]:
for index, row in df.iterrows():
    print(row['date'], row['event'])
    print("-"*30)

In [ ]:
df.describe()

In [ ]:
df.dropna().apply(lambda x: x[3]**2, axis = 1)

In [ ]:
df.dropna().apply(lambda x: (x[2] + x[3])**2, axis = 1)

In [ ]:
df.apply(lambda x: 3 if np.isnan(x[2]) else x[2]**2, axis = 1)